plumbum/scmRTOS_LPC21xx_GCC/Samples/ARM7/LPC2xxx/GCC4.x/1-EventFlag/utils/lpc21isp_148x.c
                    tmpString[tmpStringPos++] = (char)(' ' + 45);  // Encode Length of block

                    for(BlockOffset = 0; BlockOffset < 45; BlockOffset++)
                    {
                        if(IspEnvironment->BinaryOffset < LPC_RAMSTART)
                        { // Flash: use full memory
                            c = IspEnvironment->BinaryContent[Pos + Block * 45 + BlockOffset];
                        }
                        else
                        { // RAM: Skip first 0x200 bytes, these are used by the download program in LPC21xx
                            c = IspEnvironment->BinaryContent[Pos + Block * 45 + BlockOffset + 0x200];
                        }

                        block_CRC += c;

                        k = (k << 8) + (c & 255);

                        if((BlockOffset % 3) == 2)   // Collecting always 3 Bytes, then do processing in 4 Bytes
                        {
                            tmpString[tmpStringPos++] = uuencode_table[(k >> 18) & 63];
                            tmpString[tmpStringPos++] = uuencode_table[(k >> 12) & 63];
                            tmpString[tmpStringPos++] = uuencode_table[(k >>  6) & 63];
                            tmpString[tmpStringPos++] = uuencode_table[ k        & 63];
                        }
                    }

                    tmpString[tmpStringPos++] = '\r';
                    tmpString[tmpStringPos++] = '\n';
                    tmpString[tmpStringPos++] = 0;

                    SendComPort( IspEnvironment, tmpString);

                    ReceiveComPort( IspEnvironment, Answer, sizeof(Answer)-1, &realsize, 1,5000);

                    if(strncmp(Answer, tmpString, tmpStringPos) != 0)
                    {
                        DebugPrintf( 1, "Error on writing data (1)\n");
                        return( ERROR_WRITE_DATA );
                    }

                    Line++;

                    DebugPrintf( 3, "Line = %d\n", Line);

                    if(Line == 20)
                    {
                            // printf("block_CRC = %ld\n", block_CRC);

                        sprintf(tmpString, "%ld\r\n", block_CRC);
                        SendComPort( IspEnvironment, tmpString);

                        ReceiveComPort( IspEnvironment, Answer, sizeof(Answer)-1, &realsize, 2,5000);

                        sprintf(tmpString, "%ld\r\nOK\r\n", block_CRC);
                        if(strcmp(Answer, tmpString) != 0)
                        {
                            DebugPrintf( 1, "Error on writing block_CRC (1)\n");
                            return( ERROR_WRITE_CRC );
                        }

                        Line = 0;
                        block_CRC = 0;
                    }
                }
            }

            if(Line != 0)
            {
                sprintf(tmpString, "%ld\r\n", block_CRC);
                SendComPort( IspEnvironment, tmpString);

                ReceiveComPort( IspEnvironment, Answer, sizeof(Answer)-1, &realsize, 2,5000);

                sprintf(tmpString, "%ld\r\nOK\r\n", block_CRC);
                if(strcmp(Answer, tmpString) != 0)
                {
                    DebugPrintf( 1, "Error on writing block_CRC (2)\n");
                    return( ERROR_WRITE_CRC2 );
                }
            }

            if(IspEnvironment->BinaryOffset < LPC_RAMSTART)
            {
                    // Prepare command must be repeated before every write
                sprintf(tmpString, "P %ld %ld\r\n", Sector, Sector);
                if (!SendAndVerify(IspEnvironment, tmpString, Answer, sizeof Answer))
                {
                    DebugPrintf( 1, "Wrong answer on Prepare-Command (2) (Sector %ld)\n", Sector);
                    PhilipsOutputErrorMessage(GetErrorNumber(Answer));
                    return( WRONG_ANSWER_PREP2 + GetErrorNumber(Answer) );
                }

                   // Round CopyLength up to one of the following values: 512, 1024,
                   // 4096, 8192; but do not exceed the maximum copy size (usually
                   // 8192, but chip-dependent)
                if(CopyLength < 512)
                {
                    CopyLength = 512;
                }
                else if(SectorLength < 1024)
                {
                    CopyLength = 1024;
                }
                else if(SectorLength < 4096)
                {
                    CopyLength = 4096;
                }
                else
                {
                    CopyLength = 8192;
                }
                if(CopyLength > (unsigned)LPCtypes[IspEnvironment->DetectedDevice].MaxCopySize)
                {
                    CopyLength = LPCtypes[IspEnvironment->DetectedDevice].MaxCopySize;
                }

                sprintf(tmpString, "C %ld %ld %ld\r\n", SectorStart + SectorOffset, LPC_RAMBASE, CopyLength);
                if (!SendAndVerify(IspEnvironment, tmpString, Answer, sizeof Answer))
                {
                    DebugPrintf( 1, "Wrong answer on Copy-Command\n");
                    PhilipsOutputErrorMessage(GetErrorNumber(Answer));
                    return( WRONG_ANSWER_COPY + GetErrorNumber(Answer) );
                }
                if (IspEnvironment->Verify)
                {

                		//Avoid compare first 64 bytes.
                		//Because first 64 bytes are re-mapped to flash boot sector,
                		//and the compare result may not be correct.
                		if (SectorStart + SectorOffset<64)
		                		sprintf(tmpString, "M %d %ld %ld\r\n", 64, LPC_RAMBASE + (64 - SectorStart - SectorOffset), CopyLength-(64 - SectorStart - SectorOffset));
		                else
		                		sprintf(tmpString, "M %ld %ld %ld\r\n", SectorStart + SectorOffset, LPC_RAMBASE, CopyLength);
		                if (!SendAndVerify(IspEnvironment, tmpString, Answer, sizeof Answer))
		                {
		                    DebugPrintf( 1, "Wrong answer on Compare-Command\n");
		                    PhilipsOutputErrorMessage(GetErrorNumber(Answer));
		                    return( WRONG_ANSWER_COPY + GetErrorNumber(Answer) );
		                }
		            }
            }

